import { m } from 'framer-motion';
import parser from 'html-react-parser';

import { Stack, Typography } from '@mui/material';

import { useLanguage } from 'src/contexts/language-context';

export function Perspectives() {
  const { renderLanguage } = useLanguage();

  return (
    <Stack
      direction={{ md: 'row', xs: 'column' }}
      spacing={4}
      sx={{ mb: 10 }}
      justifyContent="space-between"
      alignItems="flex-start"
    >
      <m.div
        initial={{ x: -100, opacity: 0 }}
        animate={{ x: 0, opacity: 1 }}
        transition={{ duration: 0.8, ease: 'easeOut' }}
      >
        <Typography
          variant="h4"
          sx={{
            fontFeatureSettings: "'case' on",
            background: 'linear-gradient(50deg, #0A66C2 0%, #05305C 100%)',
            WebkitBackgroundClip: 'text',
            WebkitTextFillColor: 'transparent',
          }}
        >
          {renderLanguage('პროექტის ამოცანები, კონტექსტი და პერსპექტივები', 'Project objectives, context and perspectives')}
        </Typography>
      </m.div>
      <m.div
        initial={{ x: 100, opacity: 0 }}
        animate={{ x: 0, opacity: 1 }}
        transition={{ duration: 0.8, ease: 'easeOut', delay: 0.2 }}
      >
        <Stack width={{ xs: '100%', md: '867px' }} direction="row" spacing={2}>
          <Typography>
            {parser(renderLanguage(
              `ევროპული სკოლა ინსტიტუციურად, სტრუქტურულად და ფასეულობით დონეზე გამართულ სასწავლო მოდელს სთავაზობს სტუდენტებს. სკოლას აქვს იმის ამბიცია, რომ არ წარმოადგენდეს მხოლოდ ვიწრო გაგებით სასწავლო დაწესებულებას და განიხილებოდეს, როგორც საგანმანათლებლო სივრცე თავისი უნიკალური ღირებულებებით, მიდგომებით, მკვეთრად გამოკვეთილი მიზნებით და განვითარების შემდგომი პერსპექტივებით.
              <br />
              <br />
ამ მიზნის უზრუნველსაყოფად განიხილება არაფორმალურ, ინტერაქტიულ გარემოში ალტერნატიული საგანმანათლებლო, სოციალური სივრცეების შექმნა, რომელიც, ერთი მხრივ, შეავსებს სასკოლო სივრცეს და მიაწოდებს მოსწავლეებს იმ სერვისებს, ცოდნას და უნარებს, რომლებიც მხოლოდ სასკოლო სივრცეში არ შეიძლება მუშავდებოდეს, ხოლო, მეორე მხრივ, ხელს შეუწყობს ევროპული სკოლის საზოგადოების ჩამოყალიბებას, გაამყარებს სოციალურ კონტაქტებს თაობებს, სკოლის სხვადასხვა შტოს და მოსწავლეებს შორის, შექმნის ერთიან ფასეულობით სივრცეს და დროთა განმავლობაში აქცევს ამ სივრცეებს ინტელექტუალური მიზიდულობის ცენტრად მთელი ქართული საგანმანათლებლო სივრცისთვის.
ლიდერობის სკოლა მანგლისში (პირობითი სახელწოდება) და გლობალური მოქალაქეობის აკადემია წინანდალში (პირობითი სახელწოდება) ამ მიზნების და ამოცანების უზრუნველსაყოფად შექმნილი სივრცეებია.
              <br />
              <br />
თითოეულ ამ სივრცეს უნდა ჰქონდეს თავისი უნიკალური მისია, განვითარების მოდელი, სწავლების და სოციალური სივრცის ორგანიზების ჩამოყალიბებული კონცეფცია.
              <br />
              <br />
ეს სივრცეები სტუდენტებს საშუალებას მისცემს, რომ გაუიოლდეთ დამატებით, არაფორმალურ, უფრო მეტად ინტერაქტიულ და პრაქტიკულ გამოცდილებებზე დაფუძნებულ ცოდნასთან  წვდომა, განავითარონ შესაბამისი უნარები, ეზიარონ საუნივერსიტეტო და პროფესიულ გამოცდილებაზე დაფუძნებულ სწავლებას, არ მოწყდნენ სასკოლო (ევროპული სკოლის) განვითარების მოდელს არასასკოლო სივრცეებსა და პერიოდებში და იყვნენ ერთიანი, სოციალური სივრცის და ფასეულობითი საზოგადოების ნაწილი.
              <br />
              <br />
მეორე მხრივ, ევროპულ სკოლას ექმნება საშუალება, რომ სკოლის ძირითად მისიას და მიზნებს მოარგოს სტუდენტების დასვენების, გართობის და სკოლის მიღმა განვითარების სივრცეები, შესთავაზოს მათ დამატებითი სერვისები, შექმნას არაფორმალური განათლების ცენტრი, ჩამოაყალიბოს ევროპული სკოლის საზოგადოება და აქციოს ეს სივრცეები ინტელექტუალური მიზიდულობის ცენტრად მთელი ქართული საგანმანათლებლო სივრცისთვის.`,
              `To create a space around democratic and humanistic values in an informal, interactive environment that will promote the development of leadership skills and the formation of full-fledged citizens of the future, a global world.`
            ))}
          </Typography>
        </Stack>
      </m.div>
    </Stack>
  );
}
